implement phase 2
